In [2]:
import pandas as pd

In [4]:
csh_dat_df = pd.read_csv("customer_shopping_data.csv")
csh_dat_df.head()

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,5/8/2022,Kanyon
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12/12/2021,Forum Istanbul
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,9/11/2021,Metrocity
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,16/05/2021,Metropol AVM
4,I337046,C189076,Female,53,Books,4,60.60,Cash,24/10/2021,Kanyon

In [5]:
csh_dat_df['invoice_date'] = pd.to_datetime(csh_dat_df['invoice_date'],format="%d/%m/%Y")
csh_dat_df.head()

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,2022-08-05,Kanyon
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,2021-12-12,Forum Istanbul
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,2021-11-09,Metrocity
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,2021-05-16,Metropol AVM
4,I337046,C189076,Female,53,Books,4,60.60,Cash,2021-10-24,Kanyon

In [7]:
csh_dat_df['total_price'] = csh_dat_df['quantity'] * csh_dat_df['price']
csh_dat_df.head()

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall,total_price
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,2022-08-05,Kanyon,7502.00
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,2021-12-12,Forum Istanbul,5401.53
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,2021-11-09,Metrocity,300.08
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,2021-05-16,Metropol AVM,15004.25
4,I337046,C189076,Female,53,Books,4,60.60,Cash,2021-10-24,Kanyon,242.40

In [ ]:
#groupby returns a series object
tot_prce_grp_by_price = csh_dat_df.groupby('gender')['total_price'].sum()
tot_prce_grp_by_price

gender
Female    1.502071e+08
Male      1.012987e+08
Name: total_price, dtype: float64

In [10]:
#groupby returns a series object
tot_prce_grp_by_category = csh_dat_df.groupby('category')['total_price'].sum()
tot_prce_grp_by_category

category
Books              8.345529e+05
Clothing           1.139968e+08
Cosmetics          6.792863e+06
Food & Beverage    8.495351e+05
Shoes              6.655345e+07
Souvenir           6.358247e+05
Technology         5.786235e+07
Toys               3.980426e+06
Name: total_price, dtype: float64

In [13]:
quantity_grp_by_category_gender = csh_dat_df.groupby(['category','gender'])['quantity'].sum()
quantity_grp_by_category_gender

category         gender
Books            Female     8776
                 Male       6206
Clothing         Female    62039
                 Male      41519
Cosmetics        Female    27261
                 Male      18204
Food & Beverage  Female    26362
                 Male      17915
Shoes            Female    17906
                 Male      12311
Souvenir         Female     8976
                 Male       5895
Technology       Female     8977
                 Male       6044
Toys             Female    18362
                 Male      11959
Name: quantity, dtype: int64

In [14]:
type(quantity_grp_by_category_gender)

pandas.core.series.Series

In [19]:
quantity_grp_by_category_gender.index

MultiIndex([(          'Books', 'Female'),
            (          'Books',   'Male'),
            (       'Clothing', 'Female'),
            (       'Clothing',   'Male'),
            (      'Cosmetics', 'Female'),
            (      'Cosmetics',   'Male'),
            ('Food & Beverage', 'Female'),
            ('Food & Beverage',   'Male'),
            (          'Shoes', 'Female'),
            (          'Shoes',   'Male'),
            (       'Souvenir', 'Female'),
            (       'Souvenir',   'Male'),
            (     'Technology', 'Female'),
            (     'Technology',   'Male'),
            (           'Toys', 'Female'),
            (           'Toys',   'Male')],
           names=['category', 'gender'])

In [22]:
# Generate a new DataFrame or Series with the index reset.
#This is useful when the index needs to be treated as a column, or when the index is 
# meaningless and needs to be reset to the default before another operation.
qty_grp_by_cat_gndr = quantity_grp_by_category_gender.reset_index()
qty_grp_by_cat_gndr
# existing indexes are added as columns to get a dataframe.

           category  gender  quantity
0             Books  Female      8776
1             Books    Male      6206
2          Clothing  Female     62039
3          Clothing    Male     41519
4         Cosmetics  Female     27261
5         Cosmetics    Male     18204
6   Food & Beverage  Female     26362
7   Food & Beverage    Male     17915
8             Shoes  Female     17906
9             Shoes    Male     12311
10         Souvenir  Female      8976
11         Souvenir    Male      5895
12       Technology  Female      8977
13       Technology    Male      6044
14             Toys  Female     18362
15             Toys    Male     11959

Pivot Table creates Dataframes.
GroupBy creates a Series.

In [ ]:
csh_dat_df.groupby('category')['quantity'].mean()

category
Books              3.007830
Clothing           3.002813
Cosmetics          3.011525
Food & Beverage    2.996548
Shoes              3.011461
Souvenir           2.974795
Technology         3.006605
Toys               3.005948
Name: quantity, dtype: float64

In [35]:
#individual stats
csh_dat_df.groupby('category')['quantity'].std()

category
Books              1.418658
Clothing           1.413708
Cosmetics          1.413136
Food & Beverage    1.419154
Shoes              1.408128
Souvenir           1.412148
Technology         1.411009
Toys               1.405269
Name: quantity, dtype: float64

In [36]:
# multiple agg function
cat_qty_series = csh_dat_df.groupby('category')['quantity']
cat_qty_stats_agg = cat_qty_series.agg(['min','max','mean','median','std','var'])
cat_qty_stats_agg

                 min  max      mean  median       std       var
category
Books              1    5  3.007830     3.0  1.418658  2.012589
Clothing           1    5  3.002813     3.0  1.413708  1.998571
Cosmetics          1    5  3.011525     3.0  1.413136  1.996952
Food & Beverage    1    5  2.996548     3.0  1.419154  2.013998
Shoes              1    5  3.011461     3.0  1.408128  1.982825
Souvenir           1    5  2.974795     3.0  1.412148  1.994162
Technology         1    5  3.006605     3.0  1.411009  1.990947
Toys               1    5  3.005948     3.0  1.405269  1.974781

In [38]:
#named aggregation
csh_dat_df.groupby('category').agg(Mean_Qty_per_ctgry=('quantity','mean'), Std_Qty_per_ctgry=('quantity','std'))

                 Mean_Qty_per_ctgry  Std_Qty_per_ctgry
category
Books                      3.007830           1.418658
Clothing                   3.002813           1.413708
Cosmetics                  3.011525           1.413136
Food & Beverage            2.996548           1.419154
Shoes                      3.011461           1.408128
Souvenir                   2.974795           1.412148
Technology                 3.006605           1.411009
Toys                       3.005948           1.405269

In [39]:
csh_dat_df.groupby('category').agg(Revenue=('total_price','sum'), Avg_Qty=('quantity','mean'), Total_Q=('quantity','sum'))

                      Revenue   Avg_Qty  Total_Q
category
Books            8.345529e+05  3.007830    14982
Clothing         1.139968e+08  3.002813   103558
Cosmetics        6.792863e+06  3.011525    45465
Food & Beverage  8.495351e+05  2.996548    44277
Shoes            6.655345e+07  3.011461    30217
Souvenir         6.358247e+05  2.974795    14871
Technology       5.786235e+07  3.006605    15021
Toys             3.980426e+06  3.005948    30321

In [ ]:
#export report to csv
catgry_report = csh_dat_df.groupby('category').agg(Revenue=('total_price','sum'), Avg_Qty=('quantity','mean'), Total_Q=('quantity','sum'))
catgry_report.to_csv("category_report.csv")

In [42]:
#Pivot Table
cat_std_pivot_tabe_df1 = pd.pivot_table(data=csh_dat_df,index='category',values='quantity', aggfunc='std')
cat_std_pivot_tabe_df1

                 quantity
category
Books            1.418658
Clothing         1.413708
Cosmetics        1.413136
Food & Beverage  1.419154
Shoes            1.408128
Souvenir         1.412148
Technology       1.411009
Toys             1.405269

In [46]:
#Pivot Table
cat_std_pivot_tabe_df2 = pd.pivot_table(data=csh_dat_df,index='category',values='quantity', aggfunc='sum').reset_index()
cat_std_pivot_tabe_df2

          category  quantity
0            Books     14982
1         Clothing    103558
2        Cosmetics     45465
3  Food & Beverage     44277
4            Shoes     30217
5         Souvenir     14871
6       Technology     15021
7             Toys     30321

In [ ]:
#Pivot Table helps in achieving differrent layouts
cat_std_pivot_tabe_df3 = pd.pivot_table(data=csh_dat_df,index='category',columns='gender',values='quantity', aggfunc='sum').reset_index()
cat_std_pivot_tabe_df3

gender         category  Female   Male
0                 Books    8776   6206
1              Clothing   62039  41519
2             Cosmetics   27261  18204
3       Food & Beverage   26362  17915
4                 Shoes   17906  12311
5              Souvenir    8976   5895
6            Technology    8977   6044
7                  Toys   18362  11959

In [52]:
#Pivot Table helps in achieving differrent layouts
cat_std_pivot_tabe_df4 = pd.pivot_table(data=csh_dat_df,index=['shopping_mall','category'],columns='gender',values='quantity', aggfunc='sum').reset_index()
cat_std_pivot_tabe_df4

gender shopping_mall         category  Female  Male
0        Cevahir AVM            Books     444   348
1        Cevahir AVM         Clothing    3091  2089
2        Cevahir AVM        Cosmetics    1319   855
3        Cevahir AVM  Food & Beverage    1327   966
4        Cevahir AVM            Shoes     940   533
..               ...              ...     ...   ...
75      Zorlu Center  Food & Beverage    1270   946
76      Zorlu Center            Shoes    1010   579
77      Zorlu Center         Souvenir     408   308
78      Zorlu Center       Technology     496   269
79      Zorlu Center             Toys     828   698

[80 rows x 4 columns]

In [53]:
#Pivot Table helps in achieving differrent layouts
qty_pvt_mall_catgry_rprt = pd.pivot_table(data=csh_dat_df,index=['shopping_mall','category'],columns='gender',values='quantity', aggfunc='sum')
qty_pvt_mall_catgry_rprt

gender                         Female  Male
shopping_mall category
Cevahir AVM   Books               444   348
              Clothing           3091  2089
              Cosmetics          1319   855
              Food & Beverage    1327   966
              Shoes               940   533
...                               ...   ...
Zorlu Center  Food & Beverage    1270   946
              Shoes              1010   579
              Souvenir            408   308
              Technology          496   269
              Toys                828   698

[80 rows x 2 columns]

In [55]:
qty_pvt_mall_catgry_rprt.columns

Index(['Female', 'Male'], dtype='object', name='gender')

In [57]:
qty_pvt_mall_catgry_rprt.columns=['qty_male','qty_female']
qty_pvt_mall_catgry_rprt

                               qty_male  qty_female
shopping_mall category
Cevahir AVM   Books                 444         348
              Clothing             3091        2089
              Cosmetics            1319         855
              Food & Beverage      1327         966
              Shoes                 940         533
...                                 ...         ...
Zorlu Center  Food & Beverage      1270         946
              Shoes                1010         579
              Souvenir              408         308
              Technology            496         269
              Toys                  828         698

[80 rows x 2 columns]